* post
** users/login

#+name: get-admin-token
#+begin_src shell
      AUTH_TOKEN_ADMIN=$(curl -L -X POST 'http://localhost:3000/users/login' \
                  -H 'Content-Type: application/json' \
                  --data '{"username": "admin", "password": "123"}' | jq -r ".token")
      echo $AUTH_TOKEN_ADMIN;
#+end_src

#+RESULTS: get-admin-token
: eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6MSwiaWF0IjoxNjQ2NTEwNDEwLCJleHAiOjE2NDY1MTU0MTB9.rXXCiW9OLYGqlb30I2uk_V39iU68tGk6bOgg1lbx5vo

#+name: get-user-token
#+begin_src shell
     AUTH_TOKEN_USER=$(curl -L -X POST 'http://localhost:3000/users/login' \
                 -H 'Content-Type: application/json' \
                 --data '{"username": "jon@gmail.com", "password": "qwerty"}' | jq -r ".token")
     echo $AUTH_TOKEN_USER;
#+end_src

#+RESULTS: get-user-token
: eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6MiwiaWF0IjoxNjQ2NTEwODM0LCJleHAiOjE2NDY1MTU4MzR9.VgEP-Pzd_whHnGlygpl1mLoj2-i_ZBuy53AXXEQnMjM

** users/register
#+BEGIN_SRC shell :results raw
  curl --location --request POST 'http://localhost:3000/users/register' \
       -H 'Content-Type: application/json' \
       --data '{"username": "jon@gmail.com", "password": "qwerty"}'
#+END_SRC

#+RESULTS:
{"id":2,"username":"jon@gmail.com","admin":false}
{"id":2,"username":"skuli@gmail.com","admin":false}
{"Skilaboð":"Skráning tókst","nafn":"skuli","notendanafn":"skuli@gmail.com"}
{"id":3,"name":"skuli","username":"skuli@gmail.com","password":"$2b$11$8ycuD51NlNb/7qEEMMLRC.FAitbk0RLdRT7S7epqwfvalXod2WgEW","isadmin":false}

** categories/
#+BEGIN_SRC shell :var AUTH_TOKEN_USER=get-user-token
  curl -L -X POST "http://localhost:3000/categories" \
       -H "Authorization: Bearer $AUTH_TOKEN_USER" \
       -H "Content-Type: application/json" \
       --data '{ "title": "Súpapopa"}'
#+END_SRC

#+RESULTS:
: error":"insufficient authorization
{"error":"invalid token"}
{"error":"invalid token"}
{"error":"invalid token"}

#+BEGIN_SRC shell :var AUTH_TOKEN_ADMIN=get-admin-token
  curl -L -X POST "http://localhost:3000/categories" \
       -H "Authorization: Bearer $AUTH_TOKEN_ADMIN" \
       -H "Content-Type: application/json" \
       --data '{ "title": "Súpasip"}'
#+END_SRC

#+RESULTS:


** cart
#+BEGIN_SRC shell :var AUTH_TOKEN_ADMIN=get-admin-token :results raw
  curl -L -X POST "Http://localhost:3000/cart" \
       -H "Content-Type: application/json"
#+END_SRC

#+RESULTS:
{"id":"c8c77790-b66c-4e42-a5b4-d045b7441f16"}
{"id":"ec24d380-44ee-4fd9-84e6-96a4bab16003"}
null
null
null
null

** cart/:cartid
#+BEGIN_SRC shell :var AUTH_TOKEN_ADMIN=get-admin-token :results raw
  curl -L -X POST "Http://localhost:3000/cart/c75a4f3c-083d-4805-b6ce-b990d044db47" \
       -H "Content-Type: application/json" \
       --data '{"productId": 20, "amount": 2}'
#+END_SRC

#+RESULTS:
null
null
null
null
null
null
{"id":"c75a4f3c-083d-4805-b6ce-b990d044db47","lines":[{"title":"Marinara","price":1590,"productid":1,"amount":2},{"title":"Margherita","price":1990,"productid":2,"amount":1},{"title":"Patate","price":2390,"productid":3,"amount":3}],"total":12340}

* get
** users/

#+BEGIN_SRC shell :var AUTH_TOKEN_ADMIN=get-admin-token
   curl -L -X GET "http://localhost:3000/users/"\
        -H "Authorization: Bearer $AUTH_TOKEN_ADMIN"\
        -H "Content-Type: application/json"
#+END_SRC

#+RESULTS:
: error":"Not found

** users/:id

#+BEGIN_SRC shell :var AUTH_TOKEN_ADMIN=get-admin-token
  curl -L -X GET "http://localhost:3000/users/2" \
       -H "Authorization: Bearer $AUTH_TOKEN_ADMIN" \
       -H "Content-Type: application/json"
#+END_SRC

#+RESULTS:
| id | jon@gmail.com | $2b$11$qjPopjago8sXKWhCUC9SYeV4SH22U9dhBPJLo6hx8XaA2orngTRmC | admin:false} |

** users/me
#+BEGIN_SRC shell :var AUTH_TOKEN_USER=get-user-token
  curl --location --request GET "http://localhost:3000/users/me" \
       -H "Authorization: Bearer $AUTH_TOKEN_USER" \
       -H "Content-Type: application/json"
#+END_SRC

#+RESULTS:
| id | jon@gmail.com | admin:false} |


#+BEGIN_SRC shell :var AUTH_TOKEN_ADMIN=get-admin-token
  curl --location --request GET "http://localhost:3000/users/me" \
       -H "Authorization: Bearer $AUTH_TOKEN_ADMIN" \
       -H "Content-Type: application/json"
#+END_SRC

#+RESULTS:
| id | admin | admin:true} |

** menu

#+BEGIN_SRC shell :var AUTH_TOKEN=get-admin-token :results raw
  curl -L -X GET "Http://localhost:3000/menu" \
       -H "Content-Type: application/json"
#+END_SRC

#+RESULTS:
{"page":1,"total":22,"totalPages":3,"items":[{"id":22,"title":"Flöskubjór","price":1290,"description":"Peroni, 33cl","img":"https://res.cloudinary.com/emh33/image/upload/v1647216331/beer-bottle_ukfy8g.jpg","categoryid":5,"created":"2022-03-02T20:56:52.090Z","lastedit":"2022-03-02T20:56:52.090Z"},{"id":21,"title":"Kranabjór","price":990,"description":"Egils Gull, 50cl","img":"https://res.cloudinary.com/emh33/image/upload/v1647216330/beer_b5fytk.jpg","categoryid":5,"created":"2022-03-02T20:56:08.782Z","lastedit":"2022-03-02T20:56:08.782Z"},{"id":20,"title":"Hvítvín hússins","price":990,"description":"Falanghina, Kampanía, 20cl","img":"https://res.cloudinary.com/emh33/image/upload/v1647216332/white-wine_qezuxm.jpg","categoryid":5,"created":"2022-03-02T20:53:44.034Z","lastedit":"2022-03-02T20:53:44.034Z"},{"id":19,"title":"Rauðvín hússins","price":990,"description":"Aglianico, Kampanía, 20cl","img":"https://res.cloudinary.com/emh33/image/upload/v1647216331/red-wine_zbpn8v.jpg","categoryid":5,"created":"2022-03-02T20:52:55.025Z","lastedit":"2022-03-02T20:52:55.025Z"},{"id":18,"title":"Penne con verdure","price":2690,"description":"Penne með grænmeti, sólþurrkaðum tómatum og ólífum","img":"https://res.cloudinary.com/emh33/image/upload/v1647216331/penne-con-verdure_ipdo99.jpg","categoryid":4,"created":"2022-03-02T20:48:57.096Z","lastedit":"2022-03-02T20:48:57.096Z"},{"id":16,"title":"Penne all'arrabiata","price":2490,"description":"Penne með chilli og tómatsósu","img":"https://res.cloudinary.com/emh33/image/upload/v1647216331/penne-all_arrabiata_qoicwt.jpg","categoryid":4,"created":"2022-03-02T20:45:34.557Z","lastedit":"2022-03-02T20:45:34.557Z"},{"id":17,"title":"Spaghetti Bolognese","price":2890,"description":"Spaghetti með kjötsósu","img":"https://res.cloudinary.com/emh33/image/upload/v1647216331/spaghetti-bolognese_sllsm9.jpg","categoryid":4,"created":"2022-03-02T20:44:18.829Z","lastedit":"2022-03-02T20:44:18.829Z"},{"id":15,"title":"Spaghetti Carbonara","price":2890,"description":"Spaghetti með beikon, rjóma, eggi og svörtum pipar","img":"https://res.cloudinary.com/emh33/image/upload/v1647216332/spaghetti-carbonara_jjkrfx.jpg","categoryid":4,"created":"2022-03-02T20:42:52.845Z","lastedit":"2022-03-02T20:42:52.845Z"},{"id":14,"title":"Lasagne","price":2890,"description":"Lasagna með Bolognese- og Bechamel sósu","img":"https://res.cloudinary.com/emh33/image/upload/v1647216331/lasagne_mzfmgv.jpg","categoryid":4,"created":"2022-03-02T20:41:44.834Z","lastedit":"2022-03-02T20:41:44.834Z"},{"id":13,"title":"Fritto Cotto","price":2390,"description":"Djúpsteikt Margherita með skinku","img":"https://res.cloudinary.com/emh33/image/upload/v1647217106/fritto-cotto_huxsfz.jpg","categoryid":1,"created":"2022-03-02T20:34:31.899Z","lastedit":"2022-03-02T20:34:31.899Z"}],"first":true,"last":false,"hasPrev":false,"hasNext":true,"prevUrl":"/?page=0","nextUrl":"/?page=2"}
{"page":1,"total":22,"totalPages":3,"items":[{"id":22,"title":"Flöskubjór","price":1290,"description":"Peroni, 33cl","img":"https://res.cloudinary.com/emh33/image/upload/v1647216331/beer-bottle_ukfy8g.jpg","categoryid":5,"created":"2022-03-02T20:56:52.090Z","lastedit":"2022-03-02T20:56:52.090Z"},{"id":21,"title":"Kranabjór","price":990,"description":"Egils Gull, 50cl","img":"https://res.cloudinary.com/emh33/image/upload/v1647216330/beer_b5fytk.jpg","categoryid":5,"created":"2022-03-02T20:56:08.782Z","lastedit":"2022-03-02T20:56:08.782Z"},{"id":20,"title":"Hvítvín hússins","price":990,"description":"Falanghina, Kampanía, 20cl","img":"https://res.cloudinary.com/emh33/image/upload/v1647216332/white-wine_qezuxm.jpg","categoryid":5,"created":"2022-03-02T20:53:44.034Z","lastedit":"2022-03-02T20:53:44.034Z"},{"id":19,"title":"Rauðvín hússins","price":990,"description":"Aglianico, Kampanía, 20cl","img":"https://res.cloudinary.com/emh33/image/upload/v1647216331/red-wine_zbpn8v.jpg","categoryid":5,"created":"2022-03-02T20:52:55.025Z","lastedit":"2022-03-02T20:52:55.025Z"},{"id":18,"title":"Penne con verdure","price":2690,"description":"Penne með grænmeti, sólþurrkaðum tómatum og ólífum","img":"https://res.cloudinary.com/emh33/image/upload/v1647216331/penne-con-verdure_ipdo99.jpg","categoryid":4,"created":"2022-03-02T20:48:57.096Z","lastedit":"2022-03-02T20:48:57.096Z"},{"id":16,"title":"Penne all'arrabiata","price":2490,"description":"Penne með chilli og tómatsósu","img":"https://res.cloudinary.com/emh33/image/upload/v1647216331/penne-all_arrabiata_qoicwt.jpg","categoryid":4,"created":"2022-03-02T20:45:34.557Z","lastedit":"2022-03-02T20:45:34.557Z"},{"id":17,"title":"Spaghetti Bolognese","price":2890,"description":"Spaghetti með kjötsósu","img":"https://res.cloudinary.com/emh33/image/upload/v1647216331/spaghetti-bolognese_sllsm9.jpg","categoryid":4,"created":"2022-03-02T20:44:18.829Z","lastedit":"2022-03-02T20:44:18.829Z"},{"id":15,"title":"Spaghetti Carbonara","price":2890,"description":"Spaghetti með beikon, rjóma, eggi og svörtum pipar","img":"https://res.cloudinary.com/emh33/image/upload/v1647216332/spaghetti-carbonara_jjkrfx.jpg","categoryid":4,"created":"2022-03-02T20:42:52.845Z","lastedit":"2022-03-02T20:42:52.845Z"},{"id":14,"title":"Lasagne","price":2890,"description":"Lasagna með Bolognese- og Bechamel sósu","img":"https://res.cloudinary.com/emh33/image/upload/v1647216331/lasagne_mzfmgv.jpg","categoryid":4,"created":"2022-03-02T20:41:44.834Z","lastedit":"2022-03-02T20:41:44.834Z"},{"id":13,"title":"Fritto Cotto","price":2390,"description":"Djúpsteikt Margherita með skinku","img":"https://res.cloudinary.com/emh33/image/upload/v1647217106/fritto-cotto_huxsfz.jpg","categoryid":1,"created":"2022-03-02T20:34:31.899Z","lastedit":"2022-03-02T20:34:31.899Z"}],"first":true,"last":false,"hasPrev":false,"hasNext":true,"prevUrl":"/?page=0","nextUrl":"/?page=2"}
{"page":1,"total":22,"totalPages":3,"items":[{"id":22,"title":"Flöskubjór","price":1290,"description":"Peroni, 33cl","img":"https://res.cloudinary.com/emh33/image/upload/v1647216331/beer-bottle_ukfy8g.jpg","categoryid":5,"created":"2022-03-02T20:56:52.090Z","lastedit":"2022-03-02T20:56:52.090Z"},{"id":21,"title":"Kranabjór","price":990,"description":"Egils Gull, 50cl","img":"https://res.cloudinary.com/emh33/image/upload/v1647216330/beer_b5fytk.jpg","categoryid":5,"created":"2022-03-02T20:56:08.782Z","lastedit":"2022-03-02T20:56:08.782Z"},{"id":20,"title":"Hvítvín hússins","price":990,"description":"Falanghina, Kampanía, 20cl","img":"https://res.cloudinary.com/emh33/image/upload/v1647216332/white-wine_qezuxm.jpg","categoryid":5,"created":"2022-03-02T20:53:44.034Z","lastedit":"2022-03-02T20:53:44.034Z"},{"id":19,"title":"Rauðvín hússins","price":990,"description":"Aglianico, Kampanía, 20cl","img":"https://res.cloudinary.com/emh33/image/upload/v1647216331/red-wine_zbpn8v.jpg","categoryid":5,"created":"2022-03-02T20:52:55.025Z","lastedit":"2022-03-02T20:52:55.025Z"},{"id":18,"title":"Penne con verdure","price":2690,"description":"Penne með grænmeti, sólþurrkaðum tómatum og ólífum","img":"https://res.cloudinary.com/emh33/image/upload/v1647216331/penne-con-verdure_ipdo99.jpg","categoryid":4,"created":"2022-03-02T20:48:57.096Z","lastedit":"2022-03-02T20:48:57.096Z"},{"id":16,"title":"Penne all'arrabiata","price":2490,"description":"Penne með chilli og tómatsósu","img":"https://res.cloudinary.com/emh33/image/upload/v1647216331/penne-all_arrabiata_qoicwt.jpg","categoryid":4,"created":"2022-03-02T20:45:34.557Z","lastedit":"2022-03-02T20:45:34.557Z"},{"id":17,"title":"Spaghetti Bolognese","price":2890,"description":"Spaghetti með kjötsósu","img":"https://res.cloudinary.com/emh33/image/upload/v1647216331/spaghetti-bolognese_sllsm9.jpg","categoryid":4,"created":"2022-03-02T20:44:18.829Z","lastedit":"2022-03-02T20:44:18.829Z"},{"id":15,"title":"Spaghetti Carbonara","price":2890,"description":"Spaghetti með beikon, rjóma, eggi og svörtum pipar","img":"https://res.cloudinary.com/emh33/image/upload/v1647216332/spaghetti-carbonara_jjkrfx.jpg","categoryid":4,"created":"2022-03-02T20:42:52.845Z","lastedit":"2022-03-02T20:42:52.845Z"},{"id":14,"title":"Lasagne","price":2890,"description":"Lasagna með Bolognese- og Bechamel sósu","img":"https://res.cloudinary.com/emh33/image/upload/v1647216331/lasagne_mzfmgv.jpg","categoryid":4,"created":"2022-03-02T20:41:44.834Z","lastedit":"2022-03-02T20:41:44.834Z"},{"id":13,"title":"Fritto Cotto","price":2390,"description":"Djúpsteikt Margherita með skinku","img":"https://res.cloudinary.com/emh33/image/upload/v1647217106/fritto-cotto_huxsfz.jpg","categoryid":1,"created":"2022-03-02T20:34:31.899Z","lastedit":"2022-03-02T20:34:31.899Z"}],"first":true,"last":false,"hasPrev":false,"hasNext":true,"prevUrl":"/?page=0","nextUrl":"/?page=2"}

** menu

#+BEGIN_SRC shell :var AUTH_TOKEN=get-admin-token :results raw
  curl -L -X GET "Http://localhost:3000/menu?search=sal" \
       -H "Content-Type: application/json"
#+END_SRC

#+RESULTS:
{"page":1,"total":22,"totalPages":3,"menu":[{"id":12,"title":"Fritto Salame","price":2390,"description":"Djúpsteikt Margherita með pepperóni","img":"todo","categoryid":1,"created":"2022-03-02T20:30:52.561Z","lastedit":"2022-03-02T20:30:52.561Z"},{"id":11,"title":"Salame","price":2390,"description":"Margherita með pepperóní","img":"todo","categoryid":3,"created":"2022-03-02T20:20:50.737Z","lastedit":"2022-03-02T20:20:50.737Z"}],"first":true,"last":true,"hasPrev":false,"hasNext":false,"prevUrl":"/?page=0","nextUrl":"/?page=2"}

** categories

#+BEGIN_SRC shell :var AUTH_TOKEN=get-admin-token :results raw
  curl -L -X GET "Http://localhost:3000/categories" \
       -H "Content-Type: application/json"
#+END_SRC

#+RESULTS:

** cart/:cartid
#+BEGIN_SRC shell :var AUTH_TOKEN_ADMIN=get-admin-token :results raw
  curl -L -X GET "Http://localhost:3000/cart/c75a4f3c-083d-4805-b6ce-b990d044db47" \
       -H "Content-Type: application/json"
#+END_SRC

#+RESULTS:
{"id":"c75a4f3c-083d-4805-b6ce-b990d044db47","lines":[{"title":"Marinara","price":1590,"productid":1,"amount":1},{"title":"Margherita","price":1990,"productid":2,"amount":2},{"title":"Patate","price":2390,"productid":3,"amount":1}],"total":7960}
{"id":"c75a4f3c-083d-4805-b6ce-b990d044db47","lines":[{"title":"Marinara","price":1590,"productid":1,"amount":2},{"title":"Margherita","price":1990,"productid":2,"amount":1},{"title":"Patate","price":2390,"productid":3,"amount":3},{"title":"Kranabjór","price":990,"productid":21,"amount":3}],"total":15310}
{"id":"c75a4f3c-083d-4805-b6ce-b990d044db47","lines":[{"title":"Marinara","price":1590,"productid":1,"amount":2},{"title":"Margherita","price":1990,"productid":2,"amount":1},{"title":"Patate","price":2390,"productid":3,"amount":3}],"total":12340}

** cart/:cartid/line/:id
#+BEGIN_SRC shell :var AUTH_TOKEN_ADMIN=get-admin-token :results raw
  curl -L -X GET "Http://localhost:3000/cart/c75a4f3c-083d-4805-b6ce-b990d044db47/line/1" \
       -H "Content-Type: application/json"
#+END_SRC

#+RESULTS:
[{"id":"c75a4f3c-083d-4805-b6ce-b990d044db47","amount":1,"description":"Tómatsósa, óreganó, hvítlauksolía"}]
[{"basketid":"c75a4f3c-083d-4805-b6ce-b990d044db47","amount":1,"description":"Tómatsósa, óreganó, hvítlauksolía"}]
[{"basketid":"c75a4f3c-083d-4805-b6ce-b990d044db47","amount":2,"description":"Tómatsósa, mozzarella, basil"}]
[{"id":"c75a4f3c-083d-4805-b6ce-b990d044db47","amount":1,"description":"Tómatsósa, óreganó, hvítlauksolía"}]
[{"id":3,"productid":3,"basketid":"c75a4f3c-083d-4805-b6ce-b990d044db47","amount":1}]
[{"id":2,"productid":2,"basketid":"c75a4f3c-083d-4805-b6ce-b990d044db47","amount":2}]

* patch
** categories/:id

#+BEGIN_SRC shell :var AUTH_TOKEN_ADMIN=get-admin-token :results raw
  curl -X PATCH "http://localhost:3000/categories/6" \
       -H "Authorization: Bearer $AUTH_TOKEN_ADMIN" \
       -H "Content-Type: application/json" \
       -d '{ "title": "Aperitivo"}'
#+END_SRC

#+RESULTS:
{"error":"Not found"}
{"error":"Not found"}
{"error":"Not found"}
{"error":"Ekki tókst að uppfæru viðburðinn"}
{"update":{"id":6,"userid":2,"name":"Aðalfundur fyrir forritara","slug":"adalfundur-fyrir-forritara","description":"Ókeypis bjór!!"}}

** categories/:cartid/line/:id

#+BEGIN_SRC shell :var AUTH_TOKEN_ADMIN=get-admin-token :results raw
  curl -X PATCH "http://localhost:3000/cart/c75a4f3c-083d-4805-b6ce-b990d044db47/line/1" \
       -H "Content-Type: application/json" \
       -d '{ "amount": 5}'
#+END_SRC

#+RESULTS:

* delete
** categories/:id

#+BEGIN_SRC shell :var AUTH_TOKEN_ADMIN=get-admin-token :results raw
  curl -X DELETE "http://localhost:3000/categories/3" \
       -H "Authorization: Bearer $AUTH_TOKEN_ADMIN" \
       -H "Content-Type: application/json"
#+END_SRC

#+RESULTS:
null
null
null
null
{"error":"Not found"}

** cart/:cartid
#+BEGIN_SRC shell :var AUTH_TOKEN_ADMIN=get-admin-token :results raw
  curl -X DELETE "Http://localhost:3000/cart/c75a4f3c-083d-4805-b6ce-b990d044db47" \
       -H "Content-Type: application/json"
#+END_SRC

#+RESULTS:

** cart/:cartid/line/:id
#+BEGIN_SRC shell :var AUTH_TOKEN_ADMIN=get-admin-token :results raw
  curl -X DELETE "Http://localhost:3000/cart/c75a4f3c-083d-4805-b6ce-b990d044db47/line/2" \
       -H "Content-Type: application/json"
#+END_SRC

#+RESULTS:
{"command":"DELETE","rowCount":1,"oid":null,"rows":[],"fields":[],"_types":{"_types":{"arrayParser":{},"builtins":{"BOOL":16,"BYTEA":17,"CHAR":18,"INT8":20,"INT2":21,"INT4":23,"REGPROC":24,"TEXT":25,"OID":26,"TID":27,"XID":28,"CID":29,"JSON":114,"XML":142,"PG_NODE_TREE":194,"SMGR":210,"PATH":602,"POLYGON":604,"CIDR":650,"FLOAT4":700,"FLOAT8":701,"ABSTIME":702,"RELTIME":703,"TINTERVAL":704,"CIRCLE":718,"MACADDR8":774,"MONEY":790,"MACADDR":829,"INET":869,"ACLITEM":1033,"BPCHAR":1042,"VARCHAR":1043,"DATE":1082,"TIME":1083,"TIMESTAMP":1114,"TIMESTAMPTZ":1184,"INTERVAL":1186,"TIMETZ":1266,"BIT":1560,"VARBIT":1562,"NUMERIC":1700,"REFCURSOR":1790,"REGPROCEDURE":2202,"REGOPER":2203,"REGOPERATOR":2204,"REGCLASS":2205,"REGTYPE":2206,"UUID":2950,"TXID_SNAPSHOT":2970,"PG_LSN":3220,"PG_NDISTINCT":3361,"PG_DEPENDENCIES":3402,"TSVECTOR":3614,"TSQUERY":3615,"GTSVECTOR":3642,"REGCONFIG":3734,"REGDICTIONARY":3769,"JSONB":3802,"REGNAMESPACE":4089,"REGROLE":4096}},"text":{},"binary":{}},"RowCtor":null,"rowAsArray":false}
{"command":"DELETE","rowCount":1,"oid":null,"rows":[],"fields":[],"_types":{"_types":{"arrayParser":{},"builtins":{"BOOL":16,"BYTEA":17,"CHAR":18,"INT8":20,"INT2":21,"INT4":23,"REGPROC":24,"TEXT":25,"OID":26,"TID":27,"XID":28,"CID":29,"JSON":114,"XML":142,"PG_NODE_TREE":194,"SMGR":210,"PATH":602,"POLYGON":604,"CIDR":650,"FLOAT4":700,"FLOAT8":701,"ABSTIME":702,"RELTIME":703,"TINTERVAL":704,"CIRCLE":718,"MACADDR8":774,"MONEY":790,"MACADDR":829,"INET":869,"ACLITEM":1033,"BPCHAR":1042,"VARCHAR":1043,"DATE":1082,"TIME":1083,"TIMESTAMP":1114,"TIMESTAMPTZ":1184,"INTERVAL":1186,"TIMETZ":1266,"BIT":1560,"VARBIT":1562,"NUMERIC":1700,"REFCURSOR":1790,"REGPROCEDURE":2202,"REGOPER":2203,"REGOPERATOR":2204,"REGCLASS":2205,"REGTYPE":2206,"UUID":2950,"TXID_SNAPSHOT":2970,"PG_LSN":3220,"PG_NDISTINCT":3361,"PG_DEPENDENCIES":3402,"TSVECTOR":3614,"TSQUERY":3615,"GTSVECTOR":3642,"REGCONFIG":3734,"REGDICTIONARY":3769,"JSONB":3802,"REGNAMESPACE":4089,"REGROLE":4096}},"text":{},"binary":{}},"RowCtor":null,"rowAsArray":false}
null
